IDENTIFICATION DIVISION.
PROGRAM-ID. HelloWorld.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NAME PIC X(20).

PROCEDURE DIVISION.
    DISPLAY "Enter your name: "
    ACCEPT NAME
    DISPLAY "Hello, " NAME "!"
    STOP RUN.
